[
  {
    "id": 0,
    "name": "The Rollings Stones",
    "description": "The Rolling Stones are an English rock band formed in London in 1962. Diverging from the pop rock of the early-1960s, the Rolling Stones pioneered the gritty, heavier-driven sound that came to define hard rock. Their first stable line-up was vocalist Mick Jagger, multi-instrumentalist Brian Jones, guitarist Keith Richards, drummer Charlie Watts, and bassist Bill Wyman. During their formative years Brian Jones was the primary leader: he put the band together, named it, and drove the sound and look of the band. After Andrew Loog Oldham became the group's manager in 1963, he encouraged them to write their own songs. Jagger and Richards became the primary creative force behind the band, alienating Jones, who developed a drug addiction that interfered with his ability to meaningfully contribute. He left the band shortly before his death in 1969, having been replaced by guitarist Mick Taylor, who in turn left in 1974 to be replaced by Ronnie Wood. Since Wyman's departure in 1993,  the band has continued on as a four-piece. Rooted in blues and early rock and roll, the Rolling Stones started out playing covers and were at the forefront of the British Invasion in 1964, also being identified with the youthful and rebellious counterculture of the 1960s. They then found greater success with their own material as '(I Can't Get No) Satisfaction', 'Get Off of My Cloud' and 'Paint It Black' became No. 1 hits in the UK, North America, Australia and Europe. Aftermath (1966) – their first entirely original album – is considered the most important of their formative records. In 1967, they had the double-sided hit 'Ruby Tuesday'/'Let's Spend the Night Together' and then experimented with psychedelic rock on Their Satanic Majesties Request. They went back to their roots with such hits as 'Jumpin' Jack Flash' (1968) and 'Honky Tonk Women' (1969), and albums such as Beggars Banquet (1968), featuring 'Sympathy for the Devil', and Let It Bleed (1969), featuring 'You Can't Always Get What You Want' and 'Gimme Shelter'. Let It Bleed was the first of five straight No. 1 albums in the UK. In 1969, they were first introduced on stage as 'The Greatest Rock and Roll Band in the World'. Sticky Fingers (1971), which yielded 'Brown Sugar', was the first of eight consecutive No. 1 studio albums in the US for the Rolling Stones. Exile on Main St. (1972), featuring 'Tumbling Dice', and Goats Head Soup (1973), yielding the hit ballad 'Angie', were also best sellers. They released successful albums until the early 1980s, including their two largest sellers: Some Girls (1978), featuring the disco-tinged 'Miss You'; and Tattoo You (1981), featuring the hit rocker 'Start Me Up'. They then kept a low profile until 1989 when they released Steel Wheels, featuring 'Mixed Emotions', which was followed by Voodoo Lounge (1994), a worldwide number one album that yielded the popular 'Love Is Strong'. Both albums were promoted by large stadium and arena tours as the Stones continue to be a huge concert attraction; by 2007 they had four of the top five highest-grossing concert tours of all time. Their latest album, Blue & Lonesome (2016), became their twelfth UK number-one album. Their No Filter Tour ran for two years concluding in August 2019. They have released 30 studio albums, 23 live albums, and numerous compilations. The Rolling Stones' estimated record sales of 240 million makes them one of the best-selling music artists of all time. The band has won three Grammy Awards and a Grammy Lifetime Achievement Award. They were inducted into the Rock and Roll Hall of Fame in 1989 and the UK Music Hall of Fame in 2004. In 2008, the Rolling Stones were listed 10th on the Billboard Hot 100 All-Time Top Artists chart, and in 2019 Billboard magazine ranked them second in their list of the 'Greatest Artists of All Time' based on US chart success. They are ranked fourth on Rolling Stone’s list of the Greatest Artists of All Time.",
    "image": "rollingstones.jpg",
    "discography": [
      {
        "name": "The Rolling Stones / England´s Newest Hit Makers",
        "year": 1964
      },
      {
        "name": "12 x 5",
        "year": 1964
      },
      {
        "name": "The Rolling Stones No. 2 / The Rolling Stones, Now!",
        "year": 1965
      },
      {
        "name": "Out of Our Heads",
        "year": 1965
      },
      {
        "name": "December´s Children (And Everybody´s)",
        "year": 1965
      },
      {
        "name": "Aftermath",
        "year": 1966
      },
      {
        "name": "Between the Buttons",
        "year": 1967
      },
      {
        "name": "Their Satanic Majesties Request",
        "year": 1967
      },
      {
        "name": "Beggar Banquet",
        "year": 1968
      },
      {
        "name": "Let it Bleed",
        "year": 1969
      },
      {
        "name": "Sticky Fingers",
        "year": 1971
      },
      {
        "name": "Exile on Main St",
        "year": 1972
      },
      {
        "name": "Goats Head Soup",
        "year": 1973
      },
      {
        "name": "It´s Only Rock'n Roll",
        "year": 1974
      },
      {
        "name": "Black and Blue",
        "year": 1976
      },
      {
        "name": "Some Girls",
        "year": 1978
      },
      {
        "name": "Emotional Rescue",
        "year": 1980
      },
      {
        "name": "Tattoo You",
        "year": 1981
      },
      {
        "name": "Undercover",
        "year": 1983
      },
      {
        "name": "Dirty Work",
        "year": 1986
      },
      {
        "name": "Steel Wheels",
        "year": 1989
      },
      {
        "name": "Voodoo Lounge",
        "year": 1994
      },
      {
        "name": "Bridges to Babylon",
        "year": 1997
      },
      {
        "name": "A Bigger Bang",
        "year": 2005
      },
      {
        "name": "Blue & Lonesome",
        "year": 2016
      }
    ],
    "video": "qEuV82GqQnE",
    "webpage": "https://rollingstones.com/"
  },
  {
    "id": 1,
    "name": "Led Zeppelin",
    "description": "Led Zeppelin were an English rock band formed in London in 1968. The group consisted of vocalist Robert Plant, guitarist Jimmy Page, bassist/keyboardist John Paul Jones, and drummer John Bonham. With a heavy, guitar-driven sound, they are cited as one of the progenitors of hard rock and heavy metal, although their style drew from a variety of influences, including blues and folk music. Led Zeppelin have been credited as significantly impacting the nature of the music industry, particularly in the development of album-oriented rock (AOR) and stadium rock. Many critics consider Led Zeppelin one of the most successful, innovative and influential rock groups in history. Originally named the New Yardbirds, Led Zeppelin's deal with Atlantic Records gave them considerable artistic freedom. Initially unpopular with critics, they achieved significant commercial success with eight studio albums over ten years. Their 1969 debut, Led Zeppelin, was a top-ten album in several countries and featured such tracks as 'Good Times Bad Times', 'Dazed and Confused' and 'Communication Breakdown'. Led Zeppelin II (1969) was their first number-one album, and yielded 'Ramble On' and 'Whole Lotta Love'. In 1970 they released Led Zeppelin III which featured 'Immigrant Song'. Their untitled fourth album, commonly known as Led Zeppelin IV (1971), is one of the best-selling albums in history with 37 million copies sold. The album includes 'Black Dog', 'Rock and Roll' and 'Stairway to Heaven', with the latter being among the most popular and influential works in rock history. Houses of the Holy (1973) yielded 'The Ocean', 'Over the Hills and Far Away' and 'The Rain Song'. Physical Graffiti (1975), a double album, featured 'Trampled Under Foot' and 'Kashmir'. Page wrote most of Led Zeppelin's music, particularly early in their career, while Plant wrote most of the lyrics. Jones's keyboard-based compositions later became central to their music, which featured increasing experimentation. The latter half of their career saw a series of record-breaking tours that earned the group a reputation for excess and debauchery. Although they remained commercially and critically successful, their touring and output, which included Presence (1976) and In Through the Out Door (1979), grew limited, and the group disbanded following Bonham's death in 1980. Since then the surviving former members sporadically collaborated and participated in one-off reunions. The most successful of these was the 2007 Ahmet Ertegun Tribute Concert in London, with Bonham's son Jason Bonham on drums. Led Zeppelin are one of the best-selling music artists of all time; various sources estimate the group's record sales at 200 to 300 million units worldwide. With RIAA-certified sales of 111.5 million units, they are the third-best-selling band and fifth-best-selling act in the US. They achieved eight consecutive UK number-one albums and six number-one albums on the US Billboard 200, with five of their albums certified Diamond in the US. Rolling Stone magazine described them as 'the heaviest band of all time', 'the biggest band of the Seventies', and 'unquestionably one of the most enduring bands in rock history'. They were inducted into the Rock and Roll Hall of Fame in 1995; the museum's biography of the band states that they were 'as influential' during the 1970s as the Beatles were during the 1960s.",
    "image": "ledzeppelin.jpg",
    "discography": [
      {
        "name": "Led Zeppelin",
        "year": 1969
      },
      {
        "name": "Led Zeppelin II",
        "year": 1969
      },
      {
        "name": "Led Zeppelin III",
        "year": 1970
      },
      {
        "name": "Untitled album (de facto Led Zeppelin IV)",
        "year": 1971
      },
      {
        "name": "Houses of the Holy",
        "year": 1973
      },
      {
        "name": "Physical Graffiti",
        "year": 1975
      },
      {
        "name": "Presence",
        "year": 1976
      },
      {
        "name": "In Through the Out Door",
        "year": 1979
      },
      {
        "name": "Coda",
        "year": 1982
      }
    ],
    "video": "qEuV82GqQnE",
    "webpage": "https://www.ledzeppelin.com/"
  },
  {
    "id": 2,
    "name": "Queen",
    "description": "Queen are a British rock band formed in London in 1970. Their classic line-up was Freddie Mercury (lead vocals, piano), Brian May (guitar, vocals), Roger Taylor (drums, vocals) and John Deacon (bass). Their earliest works were influenced by progressive rock, hard rock and heavy metal, but the band gradually ventured into more conventional and radio-friendly works by incorporating further styles, such as arena rock and pop rock. Before forming Queen, May and Taylor had played together in the band Smile. Mercury was a fan of Smile and encouraged them to experiment with more elaborate stage and recording techniques. He joined in 1970 and suggested the name 'Queen'. Deacon was recruited in February 1971, before the band released their eponymous debut album in 1973. Queen first charted in the UK with their second album, Queen II, in 1974. Sheer Heart Attack later that year and A Night at the Opera in 1975 brought them international success. The latter featured 'Bohemian Rhapsody', which stayed at number one in the UK for nine weeks and helped popularise the music video format. The band's 1977 album News of the World contained 'We Will Rock You' and 'We Are the Champions', which have become anthems at sporting events. By the early 1980s, Queen were one of the biggest stadium rock bands in the world. 'Another One Bites the Dust' from The Game (1980) became their best-selling single, while their 1981 compilation album Greatest Hits is the best-selling album in the UK and is certified nine times platinum in the US. Their performance at the 1985 Live Aid concert is ranked among the greatest in rock history by various publications. In August 1986, Mercury gave his last performance with Queen at Knebworth, England. In 1991, he died of bronchopneumonia—a complication of AIDS—and Deacon retired in 1997. Since 2004, May and Taylor have toured under the 'Queen +' name with vocalists Paul Rodgers and Adam Lambert. Estimates of Queen's record sales range from 170 million to 300 million records, making them one of the world's best-selling music artists. In 1990, Queen received the Brit Award for Outstanding Contribution to British Music from the British Phonographic Industry. They were inducted into the Rock and Roll Hall of Fame in 2001. Each member has composed hit singles, and all four were inducted into the Songwriters Hall of Fame in 2003. In 2005, Queen received the Ivor Novello Award for Outstanding Song Collection from the British Academy of Songwriters, Composers, and Authors. In 2018, they were presented the Grammy Lifetime Achievement Award.",
    "image": "queen.jpg",
    "discography": [
      {
        "name": "Queen",
        "year": 1973
      },
      {
        "name": "Queen II",
        "year": 1974
      },
      {
        "name": "Sheer Heart Attack",
        "year": 1974
      },
      {
        "name": "A Night at the Opera",
        "year": 1975
      },
      {
        "name": "A Day at the Races",
        "year": 1976
      },
      {
        "name": "News of the World",
        "year": 1977
      },
      {
        "name": "Jazz",
        "year": 1978
      },
      {
        "name": "The Game",
        "year": 1980
      },
      {
        "name": "Flash Gordon",
        "year": 1980
      },
      {
        "name": "Hot Space",
        "year": 1982
      },
      {
        "name": "The Works",
        "year": 1984
      },
      {
        "name": "A Kind of Magic",
        "year": 1986
      },
      {
        "name": "The Miracle",
        "year": 1989
      },
      {
        "name": "Innuendo",
        "year": 1991
      },
      {
        "name": "Made in Heaven",
        "year": 1995
      }
    ],
    "video": "qEuV82GqQnE",
    "webpage": "https://www.queenonline.com/"
  },
  {
    "id": 3,
    "name": "Pink Floyd",
    "description": "Pink Floyd were an English rock band formed in London in 1965. Gaining an early following as one of the first British psychedelic groups, they were distinguished for their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows, and became a leading band of the progressive rock genre, cited by some as the greatest progressive rock band of all time. Pink Floyd were founded by Syd Barrett (guitar, lead vocals), Nick Mason (drums), Roger Waters (bass guitar, vocals), Richard Wright (keyboards, vocals) and Bob Klose (guitars). Under Barrett's leadership, they released two charting singles and the successful debut album, The Piper at the Gates of Dawn (1967). Guitarist and vocalist David Gilmour joined in December 1967; Barrett left in April 1968 due to deteriorating mental health. Waters became the primary lyricist and thematic leader, devising the concepts behind the band's peak of critical and commercial success with the albums The Dark Side of the Moon (1973), Wish You Were Here (1975), Animals (1977) and The Wall (1979). The musical film based on The Wall, Pink Floyd – The Wall (1982), won two BAFTA Awards. Following personal tensions, Wright left Pink Floyd in 1979, followed by Waters in 1985. Gilmour and Mason continued as Pink Floyd, rejoined later by Wright. The band produced two more albums—A Momentary Lapse of Reason (1987) and The Division Bell (1994)—and toured both albums before entering a long period of inactivity. In 2005, all but Barrett reunited for a one-off performance at the global awareness event Live 8. Barrett died in 2006, and Wright in 2008. The last Pink Floyd studio album, The Endless River (2014), was based on unreleased material from the Division Bell recording sessions. By 2013, Pink Floyd had sold more than 250 million records worldwide, making them one of the best-selling music artists of all time. The Dark Side of the Moon and The Wall are among the best-selling albums of all time, and both have been inducted into the Grammy Hall of Fame.[1] Four of the band's albums topped the US Billboard 200, and five of their albums topped the UK Album Chart. Hit singles produced include 'See Emily Play' (1967), 'Money' (1973), the three-part composition 'Another Brick in the Wall' (1979), 'Not Now John' (1983), 'On the Turning Away' (1987) and 'High Hopes' (1994). The band also composed several film scores. They were inducted into the US Rock and Roll Hall of Fame in 1996 and the UK Music Hall of Fame in 2005. In 2008, King Carl XVI Gustaf of Sweden presented Pink Floyd with the Polar Music Prize for their contribution to modern music.",
    "image": "pinkfloyd.jpeg",
    "discography": [
      {
        "name": "The Piper at the Gates of Dawn",
        "year": 1967
      },
      {
        "name": "A Saucerful of Secrets",
        "year": 1968
      },
      {
        "name": "More",
        "year": 1969
      },
      {
        "name": "Ummagumma",
        "year": 1969
      },
      {
        "name": "Atom Heart Mother",
        "year": 1970
      },
      {
        "name": "Meddle",
        "year": 1971
      },
      {
        "name": "Obscured by Clouds",
        "year": 1972
      },
      {
        "name": "The Dark Side of the Moon",
        "year": 1973
      },
      {
        "name": "Wish You Were Here",
        "year": 1975
      },
      {
        "name": "Animals",
        "year": 1977
      },
      {
        "name": "The Wall",
        "year": 1979
      },
      {
        "name": "The Final Cut",
        "year": 1983
      },
      {
        "name": "A Momentary Lapse of Reason",
        "year": 1987
      },
      {
        "name": "The Division Bell",
        "year": 1994
      },
      {
        "name": "The Endless River",
        "year": 2014
      }
    ],
    "video": "qEuV82GqQnE",
    "webpage": "https://www.pinkfloyd.com/"
  },
  {
    "id": 4,
    "name": "Deep Purple",
    "description": "Deep Purple are an English rock band formed in Hertford, Hertfordshire, in 1968.[1] They are considered to be among the pioneers of heavy metal and modern hard rock,[2][3] although their musical approach has changed over the years.[4] Originally formed as a psychedelic rock and progressive rock band, they shifted to a heavier sound with their 1970 album Deep Purple in Rock.[5] Deep Purple, together with Led Zeppelin and Black Sabbath, have been referred to as the 'unholy trinity of British hard rock and heavy metal in the early- to mid-seventies'.[6] They were listed in the 1975 Guinness Book of World Records as 'the globe's loudest band' for a 1972 concert at London's Rainbow Theatre[7][8] and have sold over 100 million albums worldwide.[9][10][11] Deep Purple have had several line-up changes and an eight-year hiatus (1976–1984). The 1968–1976 line-ups are commonly labelled Mark I, II, III and IV.[12][13] Their second and most commercially successful line-up consisted of Ian Gillan (vocals) and Roger Glover (bass), who joined founding members Jon Lord (keyboards), Ian Paice (drums) and Ritchie Blackmore (guitar). This line-up was active from 1969 to 1973 and was revived from 1984 to 1989 and again from 1992 to 1993. The band achieved more modest success in the intervening periods between 1968 and 1969 with the line-up including Rod Evans (lead vocals) and Nick Simper (bass, backing vocals), between 1974 and 1976 with the line-up including David Coverdale (lead vocals) and Glenn Hughes (bass, vocals) (and Tommy Bolin replacing Blackmore in 1975), and between 1989 and 1992 with the line-up including Joe Lynn Turner (vocals). The band's line-up (currently including Ian Gillan, and guitarist Steve Morse from 1994) has been much more stable in recent years, although keyboardist Jon Lord's retirement from the band in 2002 (being succeeded by Don Airey) left Ian Paice as the only original Deep Purple member still in the band. Deep Purple were ranked number 22 on VH1's Greatest Artists of Hard Rock programme,[14] and a poll on radio station Planet Rock ranked them 5th among the 'most influential bands ever'.[15] The band received the Legend Award at the 2008 World Music Awards. Deep Purple (specifically Blackmore, Lord, Paice, Gillan, Glover, Coverdale, Evans, and Hughes) were inducted into the Rock and Roll Hall of Fame in 2016.",
    "image": "deeppurple.jpg",
    "discography": [
      {
        "name": "Shades of Deep Purple",
        "year": 1968
      },
      {
        "name": "The Book of Taliesyn",
        "year": 1968
      },
      {
        "name": "Deep Purple",
        "year": 1969
      },
      {
        "name": "Deep Purple in Rock",
        "year": 1970
      },
      {
        "name": "Fireball",
        "year": 1971
      },
      {
        "name": "Machine Head",
        "year": 1972
      },
      {
        "name": "Who Do We Think We Are",
        "year": 1973
      },
      {
        "name": "Burn",
        "year": 1974
      },
      {
        "name": "Stombringer",
        "year": 1974
      },
      {
        "name": "Come Taste the Band",
        "year": 1975
      },
      {
        "name": "Perfect Strangers",
        "year": 1984
      },
      {
        "name": "The House of Blue Light",
        "year": 1987
      },
      {
        "name": "Slaves and Masters",
        "year": 1990
      },
      {
        "name": "The Battle Rages On",
        "year": 1993
      },
      {
        "name": "Purpendicular",
        "year": 1996
      },
      {
        "name": "Abandon",
        "year": 1998
      },
      {
        "name": "Bananas",
        "year": 2003
      },
      {
        "name": "Rapture of the Deep",
        "year": 2005
      },
      {
        "name": "Now What?!",
        "year": 2013
      },
      {
        "name": "Infinite",
        "year": 2017
      },
      {
        "name": "Whoosh!",
        "year": 2020
      }
    ],
    "video": "qEuV82GqQnE",
    "webpage": "https://deeppurple.com/"
  },
  {
    "id": 5,
    "name": "AC/DC",
    "description": "AC/DC are an Australian rock band formed in Sydney in 1973 by Scottish-born brothers Malcolm and Angus Young.[1] Their music has been variously described as hard rock, blues rock, and heavy metal,[2] but the band themselves call it simply 'rock and roll'.[3] AC/DC underwent several line-up changes before releasing their first album, 1975's High Voltage. Membership subsequently stabilised around the Young brothers, singer Bon Scott, drummer Phil Rudd, and bassist Mark Evans. Evans was fired from the band in 1977 and replaced by Cliff Williams, who has appeared on every AC/DC album since 1978's Powerage. In February 1980, Scott died of acute alcohol poisoning after a night of heavy drinking.[4] The group considered disbanding but elected to stay together, bringing in longtime Geordie vocalist Brian Johnson as Scott's replacement.[5] Later that year, the band released their first album with Johnson, Back in Black, which was dedicated to Scott's memory. The album launched AC/DC to new heights of success and became one of the best selling albums of all time. The band's eighth studio album, For Those About to Rock We Salute You (1981), was their first album to reach number one in the United States. Prior to the release of 1983's Flick of the Switch, drummer Rudd left the band and was replaced by Simon Wright, being in turn replaced by Chris Slade in 1989. The band experienced a commercial resurgence in the early nineties with the release of 1990s The Razors Edge. Rudd returned to the band in 1994, replacing Slade and appearing on the band's next five albums. Their fifteenth studio album Black Ice was the second-highest-selling album of 2008, and their biggest chart hit since For Those About to Rock, eventually reaching No.1 worldwide.[6] The band's line-up remained the same for twenty years, until 2014 with Malcolm Young's retirement due to early-onset dementia (he died in 2017) and Rudd's legal troubles. Malcolm was replaced by his nephew Stevie Young, who debuted on AC/DC's 2014 album Rock or Bust, and on its accompanying tour, previous drummer Chris Slade filled in for Rudd. In 2016, Johnson was advised to stop touring due to worsening hearing loss. Guns N' Roses frontman Axl Rose stepped in as the band's vocalist for the remainder of that year's dates. Long-term bass player and background vocalist Cliff Williams retired from AC/DC at the end of the Rock or Bust tour in 2016 and the group entered a four-year hiatus. A reunion of the Rock or Bust lineup was announced in September 2020 and the band's seventeenth studio album Power Up was released two months later. AC/DC have sold more than 200 million records worldwide, including 75 million albums in the United States, making them the ninth-highest-selling artist in the United States and the 16th-best-selling artist worldwide.[7][8][9] Back in Black has sold an estimated 50 million units worldwide, making it the third-highest-selling album by any artist, and the highest-selling album by any band. The album has sold 22 million units in the US, where it is the sixth-highest-selling album of all time.[10] AC/DC ranked fourth on VH1's list of the '100 Greatest Artists of Hard Rock'[11][12] and were named the seventh 'Greatest Heavy Metal Band of All Time' by MTV.[13] In 2004, AC/DC ranked No. 72 on the Rolling Stone list of the '100 Greatest Artists of All Time'. Producer Rick Rubin, who wrote an essay on the band for the Rolling Stone list, referred to AC/DC as 'the greatest rock and roll band of all time'.[14] In 2010, VH1 ranked AC/DC number 23 in its list of the '100 Greatest Artists of All Time'.",
    "image": "acdc.jpg",
    "discography": [
      {
        "name": "High Voltage",
        "year": 1975
      },
      {
        "name": "T.N.T.",
        "year": 1975
      },
      {
        "name": "Hight Voltage",
        "year": 1976
      },
      {
        "name": "Dirty Deeds Done Dirt Cheap",
        "year": 1976
      },
      {
        "name": "Let There Be Rock",
        "year": 1977
      },
      {
        "name": "Powerage",
        "year": 1978
      },
      {
        "name": "Highway to Hell",
        "year": 1979
      },
      {
        "name": "Back in Black",
        "year": 1980
      },
      {
        "name": "For Those About to Rock We Salute You",
        "year": 1981
      },
      {
        "name": "Flick of the Switch",
        "year": 1983
      },
      {
        "name": "Fly on the Wall",
        "year": 1985
      },
      {
        "name": "Blow Up Your Video",
        "year": 1988
      },
      {
        "name": "The Razors Edge",
        "year": 1990
      },
      {
        "name": "Ballbreaker",
        "year": 1995
      },
      {
        "name": "Stiff Upper Lip",
        "year": 2000
      },
      {
        "name": "Black Ice",
        "year": 2008
      },
      {
        "name": "Rock or Bust",
        "year": 2014
      },
      {
        "name": "Power Up",
        "year": 2020
      }
    ],
    "video": "qEuV82GqQnE",
    "webpage": "http://www.ac-dc.net/"
  },
  {
    "id": 6,
    "name": "The Ramones",
    "description": "The Ramones were an American punk rock band that formed in the New York City neighborhood of Forest Hills, Queens, in 1974. They are often cited as the first true punk rock group.[1][2] Despite achieving only limited commercial success initially, the band was highly influential in the United States, Argentina, Brazil and most of South America, as well as Europe, including the United Kingdom, the Netherlands, Germany, Sweden and Belgium. All of the band members adopted pseudonyms ending with the surname 'Ramone', although none of them were biologically related; they were inspired by Paul McCartney of the Beatles, who would check into hotels as 'Paul Ramon'. The Ramones performed 2,263 concerts, touring virtually nonstop for 22 years.[2] In 1996, after a tour with the Lollapalooza music festival, they played a farewell concert in Los Angeles and disbanded.[3] By 2014, all four of the band's original members had died – lead singer Joey Ramone (1951–2001), bassist Dee Dee Ramone (1951–2002), guitarist Johnny Ramone (1948–2004) and drummer Tommy Ramone (1949–2014).[4][5][6][7] The remaining surviving members of the Ramones—bassist C. J. Ramone (who replaced Dee Dee in 1989 and stayed with the band until its dissolution) and drummers Marky Ramone, Richie Ramone and Elvis Ramone—are still musically active. Recognition of the band's importance built over the years, and they are now mentioned in many assessments of all-time great rock music, such as number 26 in Rolling Stone magazine's list of the '100 Greatest Artists of All Time'[8] and number 17 in VH1's '100 Greatest Artists of Hard Rock'.[9] In 2002, the Ramones were ranked the second-greatest band of all time by Spin, trailing only the Beatles.[10] On March 18, 2002, the original four members and Tommy's replacement on drums, Marky Ramone, were inducted into the Rock and Roll Hall of Fame in their first year of eligibility, though Joey had died by then.[2][11] In 2011, the group was awarded a Grammy Lifetime Achievement Award.",
    "image": "ramones.jpg",
    "discography": [
      {
        "name": "Ramones",
        "year": 1976
      },
      {
        "name": "Leave Home",
        "year": 1977
      },
      {
        "name": "Rocket to Russia",
        "year": 1977
      },
      {
        "name": "Road to Ruin",
        "year": 1978
      },
      {
        "name": "End of the Century",
        "year": 1980
      },
      {
        "name": "Pleasant Dreams",
        "year": 1981
      },
      {
        "name": "Subterranean Jungle",
        "year": 1983
      },
      {
        "name": "Too Tough to Die",
        "year": 1984
      },
      {
        "name": "Halfway to Sanity",
        "year": 1987
      },
      {
        "name": "Brain Drain",
        "year": 1989
      },
      {
        "name": "Mondo Bizarro",
        "year": 1992
      },
      {
        "name": "¡Adios Amigos!",
        "year": 1995
      }
    ],
    "video": "qEuV82GqQnE",
    "webpage": "https://www.ramones.com/"
  },
  {
    "id": 7,
    "name": "Kiss",
    "description": "Kiss (often stylized as KIϟϟ) is an American rock band formed in New York City in January 1973 by Paul Stanley, Gene Simmons, Ace Frehley, and Peter Criss. Well known for its members' face paint and stage outfits, the group rose to prominence in the mid–late 1970s with its shocking live performances, which featured fire breathing, blood-spitting, smoking guitars, shooting rockets, levitating drum kits, and pyrotechnics. The band has gone through several lineup changes, with Stanley and Simmons being the only members to feature in every lineup. The original and best-known lineup consists of Stanley (vocals and rhythm guitar), Simmons (vocals and bass), Frehley (lead guitar and vocals), and Criss (drums and vocals). With their make-up and costumes, the band members took on the personae of comic book-style characters: the Starchild (Stanley), the Demon (Simmons), the Spaceman or Space Ace (Frehley), and the Catman (Criss). Due to creative differences, both Criss and Frehley had departed the group by 1982. In 1983, Kiss began performing without makeup and costumes, thus marking the beginning of the band's 'unmasked' era that would last for over a decade. The band experienced a commercial resurgence during this era, with the Platinum-certified album Lick It Up successfully introducing them to a new generation of fans, and its music videos received regular airplay on MTV. Eric Carr, who had replaced Criss in 1980, died in 1991 of heart cancer and was replaced by Eric Singer. In response to a wave of Kiss nostalgia in the mid-1990s, the original lineup re-united in 1996, which also saw the return of its makeup and stage costumes. The resulting reunion tour was highly successful, grossing $143.7 million, making it the band's most successful tour to date. Criss and Frehley subsequently left the band again, and have been replaced by Singer and Tommy Thayer. The band has continued with its original stage makeup, with Singer and Thayer using the original Catman and Spaceman makeup, respectively. In September 2018, Kiss announced that, after 45 years of recording and performing, it would be embarking on its ongoing final tour, the End of the Road World Tour, which started in January 2019 and is currently set to conclude in 2022.[1][2][3][4][5] KISS is listed among the best-selling bands of all time, having sold more than 75 million records worldwide, including 21[6] million RIAA-certified albums.[7][8] Kiss also holds the title as America's No. 1 Gold record award-winning group of all time, having earned 30 Gold albums. Kiss has 14 Platinum albums, with three albums being multi-Platinum.[9] On April 10, 2014, the four original members of Kiss were inducted into the Rock and Roll Hall of Fame. Kiss was ranked by MTV as the ninth 'Greatest Metal Band of All Time',[10] and placed tenth on VH1's '100 Greatest Artists of Hard Rock' list,[11]. Heavy metal magazine Loudwire named Kiss as one of the most influential bands of all time[12] and ranked them as the third 'Best Metal and Hard Rock Live Band of All Time'.",
    "image": "kiss.jpg",
    "discography": [
      {
        "name": "Kiss",
        "year": 1974
      },
      {
        "name": "Hotter than Hell",
        "year": 1974
      },
      {
        "name": "Dressed to Kill",
        "year": 1975
      },
      {
        "name": "Destroyer",
        "year": 1976
      },
      {
        "name": "Rock and Roll Over",
        "year": 1976
      },
      {
        "name": "Love Gun",
        "year": 1977
      },
      {
        "name": "Paul Stanley",
        "year": 1978
      },
      {
        "name": "Gene Simmons",
        "year": 1978
      },
      {
        "name": "Ace Frehley",
        "year": 1978
      },
      {
        "name": "Peter Criss",
        "year": 1978
      },
      {
        "name": "Dinasty",
        "year": 1979
      },
      {
        "name": "Unmmasked",
        "year": 1980
      },
      {
        "name": "Music from 'The Elder'",
        "year": 1981
      },
      {
        "name": "Creatures of the Night",
        "year": 1982
      },
      {
        "name": "Lick it Up",
        "year": 1983
      },
      {
        "name": "Animalize",
        "year": 1984
      },
      {
        "name": "Asylum",
        "year": 1985
      },
      {
        "name": "Crazy Nights",
        "year": 1987
      },
      {
        "name": "Hot in the Shade",
        "year": 1989
      },
      {
        "name": "Revenge",
        "year": 1992
      },
      {
        "name": "Carnival of Souls: The Final Sessions",
        "year": 1997
      },
      {
        "name": "Psycho Circus",
        "year": 1998
      },
      {
        "name": "Sonic Boom",
        "year": 2009
      },
      {
        "name": "Monster",
        "year": 2012
      }
    ],
    "video": "qEuV82GqQnE",
    "webpage": "https://www.kissonline.com/"
  }
]
